models/Users.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username]);
---
SELECT * FROM `users` WHERE `username`='admin'

    public static function findIdentity($id)
    {
        // TODO: Implement findIdentity() method.
        return static::findOne($id);
---
SELECT * FROM `users` WHERE `id`=1